In [1]:
import pandas as pd

In [23]:
df = pd.read_excel('report.xlsx', sheet_name='Sheet1', na_values='')
# df = pd.read_excel('report.xlsx', sheet_name='Sheet1')

In [25]:
df = df.fillna('')

In [29]:
df

,make money fund 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,,share class a USD,,,share class b USD,,
1,date,units,unit price,total,units,unit price,total
2,2017-11-30 00:00:00,100,1.25,125,100,2.25,225
3,2017-12-31 00:00:00,100,1.3,130,100,2.3,230

In [62]:
df.iloc[1,3]

'total'

In [64]:
df[0:3]

,make money fund 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,,share class a USD,,,share class b USD,,
1,date,units,unit price,total,units,unit price,total
2,2017-11-30 00:00:00,100,1.25,125,100,2.25,225

In [72]:
df.loc[0:2]

,make money fund 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,,share class a USD,,,share class b USD,,
1,date,units,unit price,total,units,unit price,total
2,2017-11-30 00:00:00,100,1.25,125,100,2.25,225

In [94]:
# select first 3 columns
df.iloc[:,:4]

     make money fund 1         Unnamed: 1  Unnamed: 2 Unnamed: 3
0                       share class a USD
1                 date              units  unit price      total
2  2017-11-30 00:00:00                100        1.25        125
3  2017-12-31 00:00:00                100         1.3        130

In [93]:
df

,make money fund 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,,share class a USD,,,share class b USD,,
1,date,units,unit price,total,units,unit price,total
2,2017-11-30 00:00:00,100,1.25,125,100,2.25,225
3,2017-12-31 00:00:00,100,1.3,130,100,2.3,230

In [130]:
a=df.iloc[2:,4:7] 
print(a)

  Unnamed: 4 Unnamed: 5 Unnamed: 6
2        100       2.25        225
3        100        2.3        230

In [131]:
b = df.iloc[2:,:1]
print(b)

     make money fund 1
2  2017-11-30 00:00:00
3  2017-12-31 00:00:00

In [129]:
pd.concat([b,a], axis=1)

     make money fund 1 Unnamed: 4 Unnamed: 5 Unnamed: 6
2  2017-11-30 00:00:00        100       2.25        225
3  2017-12-31 00:00:00        100        2.3        230